Tekla Open API Reference for Tekla Structures 2025
ModelObject.ModificationTime Property
Gets latest time of the object was modified or created.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DateTime? ModificationTime { get; }
Public ReadOnly Property ModificationTime As DateTime?
	Get
Return Value
Type: Nullable<DateTime>
The date, if it was possible to retrieve it, null otherwise.
Remarks
The returned time is time of history revision which the object belongs to. For Sharing it is WriteOut time, for multiuser is save time. If history it not written then this method returns null.
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace